Cisco 라우터에서 사용하는 EIGRP 구성 명령어를 리눅스 환경에서 구현하려면, 리눅스의 **동적 라우팅 프로토콜**인 **Quagga**(또는 현재는 **FRRouting**으로 대체됨) 같은 라우팅 소프트웨어를 사용해야 합니다. 여기서는 EIGRP 프로토콜을 사용하는 예시를 **FRRouting**을 기반으로 설명합니다.

---
### 1. **FRRouting 설치 및 설정**

리눅스 환경에서 EIGRP를 사용하려면 FRRouting 패키지를 설치해야 합니다. 아래는 FRRouting 설치 예시입니다.

#### **FRRouting 설치 (Ubuntu 기준)**

``` bash

sudo apt update
sudo apt install frr frr-snmp frr-doc
```

설치 후 FRRouting이 활성화되면, **`/etc/frr/frr.conf`** 파일을 사용하여 라우팅 프로토콜을 구성합니다.


---

### 1. **EIGRP 프로세스 시작**

#### **Cisco (라우터에서 EIGRP 프로세스 시작)**

``` bash
R1(config)# router eigrp 1
```

#### **리눅스 (FRRouting에서 EIGRP 프로세스 시작)**

``` bash
! /etc/frr/frr.conf 파일에 설정
router eigrp 1
```


- **Cisco**에서는 `router eigrp` 명령어를 사용해 EIGRP 프로세스를 시작합니다.
- **리눅스**에서는 `frr.conf` 파일에서 `router eigrp` 명령어로 EIGRP 프로세스를 설정합니다.


---
### 2. **네트워크 지정 (EIGRP에 포함할 네트워크 정의)**


#### **Cisco (네트워크 지정)**

``` bash
`R1(config-router)# network 10.1.10.0 0.0.0.255`
```

#### **리눅스 (네트워크 지정)**

``` bash
! /etc/frr/frr.conf 파일에 설정 
network 10.1.10.0/24

```


- **Cisco**에서는 `network` 명령어 뒤에 **와일드카드 마스크**를 사용하여 네트워크를 지정합니다.
- **리눅스**에서는 `network` 뒤에 **CIDR 표기법**을 사용합니다.
---
### 3. **다른 네트워크 추가 (EIGRP에 다른 네트워크 추가)**


#### **Cisco (다른 네트워크 추가)**

``` bash

R1(config-router)# network 10.1.12.0 0.0.0.255
```

#### **리눅스 (다른 네트워크 추가)**

``` bash
! /etc/frr/frr.conf 파일에 설정
network 10.1.12.0/24
```

- **Cisco**에서는 `network` 명령어로 여러 네트워크를 추가할 수 있습니다.
- **리눅스**에서도 동일한 방법으로 여러 네트워크를 `frr.conf` 파일에 추가합니다.


---
### 4. **정적 라우팅 재배포 (Redistribute static)**



#### **Cisco (정적 경로 재배포)**

``` bash
`R1(config-router)# redistribute static`
```


#### **리눅스 (정적 경로 재배포)**

``` bash
! /etc/frr/frr.conf 파일에 설정
redistribute static
```


- **Cisco**에서는 `redistribute static` 명령어로 **정적 경로**를 EIGRP로 재배포합니다.
- **리눅스**에서도 같은 방식으로 `redistribute static`을 사용해 정적 경로를 EIGRP 프로세스에 포함시킵니다.

---
### 5. **정적 라우팅 추가**


#### **Cisco (정적 라우팅 추가)**

``` bash
R1(config)# ip route 10.1.10.0 255.255.255.0 192.168.1.1
```

#### **리눅스 (정적 라우팅 추가)**

``` bash
sudo ip route add 10.1.10.0/24 via 192.168.1.1
```


- **Cisco**에서는 `ip route` 명령어로 정적 경로를 추가합니다.
- **리눅스**에서도 `ip route add` 명령어를 사용하여 정적 경로를 추가합니다. **CIDR 표기법**을 사용하며, 경로 지정 방식은 유사합니다.


---
### 6. **라우팅 테이블 확인**

#### **Cisco (EIGRP 라우팅 테이블 확인)**

``` bash
R1# show ip route eigrp
```


#### **리눅스 (EIGRP 라우팅 테이블 확인)**

``` bash
vtysh 
show ip route eigrp
```


- **Cisco**에서는 `show ip route eigrp` 명령어로 EIGRP 라우팅 테이블을 확인합니다.
- **리눅스**에서는 `vtysh` 명령어로 **FRRouting**에 접속한 후, 동일하게 `show ip route eigrp` 명령어로 EIGRP 라우팅 테이블을 확인합니다.



---
### 7. **EIGRP 이웃 확인**


#### **Cisco (EIGRP 이웃 확인)**

``` bash
R1# show ip eigrp neighbors
```

#### **리눅스 (EIGRP 이웃 확인)**

``` bash
vtysh
show ip eigrp neighbors
```


- **Cisco**와 **리눅스** 모두 `show ip eigrp neighbors` 명령어를 사용하여 EIGRP 이웃 라우터를 확인할 수 있습니다.
- 리눅스에서는 `vtysh` 세션에 접속해야만 해당 명령을 사용할 수 있습니다.


---
### 8. **FRRouting 재시작**

#### **Cisco (라우터 재시작 필요 없음)**


**Cisco**에서는 변경사항을 적용하기 위해 라우터를 재시작할 필요가 없습니다. 설정은 즉시 적용됩니다.

#### **리눅스 (FRRouting 재시작 필요)**

``` bash
sudo systemctl restart frr
```

- **리눅스**에서는 `frr.conf` 파일에서 설정을 변경한 후 **FRRouting**을 재시작해야 변경 사항이 적용됩니다.

### 요약

| 작업            | **Cisco 명령어**                                  | **리눅스 (FRRouting) 명령어**                          |
| ------------- | ---------------------------------------------- | ------------------------------------------------ |
| EIGRP 프로세스 시작 | `router eigrp 1`                               | `router eigrp 1`                                 |
| 네트워크 지정       | `network 10.1.10.0 0.0.0.255`                  | `network 10.1.10.0/24`                           |
| 다른 네트워크 추가    | `network 10.1.12.0 0.0.0.255`                  | `network 10.1.12.0/24`                           |
| 정적 라우팅 재배포    | `redistribute static`                          | `redistribute static`                            |
| 정적 경로 추가      | `ip route 10.1.10.0 255.255.255.0 192.168.1.1` | `sudo ip route add 10.1.10.0/24 via 192.168.1.1` |
| 라우팅 테이블 확인    | `show ip route eigrp`                          | `vtysh` → `show ip route eigrp`                  |
| EIGRP 이웃 확인   | `show ip eigrp neighbors`                      | `vtysh` → `show ip eigrp neighbors`              |
| FRRouting 재시작 | 라우터 재시작 필요 없음                                  | `sudo systemctl restart frr`                     |

### 결론

- **Cisco** 라우터에서의 설정은 명령어가 직접 적용되며, **리눅스 환경**에서는 설정 파일(`/etc/frr/frr.conf`)을 수정하고, **FRRouting** 서비스를 재시작해야 적용됩니다.
- **명령어 형식**은 유사하지만, **리눅스 환경**에서는 대부분 **CIDR 표기법**을 사용하고, **`vtysh`** 세션을 통해 라우팅 프로토콜을 관리해야 합니다.