Cisco IOS와 Linux ISC DHCP 서버를 비교하며 설정을 설명하겠습니다. **Cisco 명령어**는 장비에서 CLI 명령으로 수행되고, **Linux**에서는 파일 기반 설정으로 수행됩니다.

---
### 1. **DHCP 풀 생성**

#### Cisco IOS:

```bash
R3(config)# ip dhcp pool POOL-34

```

- **설명**: `POOL-34`라는 이름의 DHCP 풀을 생성합니다.
- Cisco IOS에서는 CLI 명령을 통해 설정을 즉시 적용합니다.


#### Linux (ISC DHCP):

`/etc/dhcp/dhcpd.conf` 파일에 설정을 추가합니다:

``` bash
subnet 1.1.34.0 netmask 255.255.255.0 { range 1.1.34.10 1.1.34.100; }

```


- **설명**: Linux에서는 설정 파일에 IP 풀(`range`)을 정의합니다.
- 네트워크 범위를 지정해 DHCP 서버가 사용할 IP 풀을 설정합니다.


---
### 2. **기본 게이트웨이 (default-router)**


#### Cisco IOS:

``` bash
R3(dhcp-config)# default-router 1.1.34.3

```

- **설명**: 클라이언트가 사용할 기본 게이트웨이 IP를 `1.1.34.3`으로 설정합니다.

#### Linux (ISC DHCP):

`/etc/dhcp/dhcpd.conf` 파일에 추가:

``` bash

option routers 1.1.34.3;
```

- **설명**: `option routers`를 통해 클라이언트가 사용할 기본 게이트웨이를 지정합니다.


---

### 3. **네트워크 및 서브넷 정의**


#### Cisco IOS:

```
R3(dhcp-config)# network 1.1.34.0 255.255.255.0
```


- **설명**: DHCP 풀의 네트워크 범위를 정의합니다. 여기서는 `1.1.34.0/24` 네트워크입니다.

#### Linux (ISC DHCP):

`/etc/dhcp/dhcpd.conf` 파일에 추가:

```bash
subnet 1.1.34.0 netmask 255.255.255.0 { 
range 1.1.34.10 1.1.34.100; 
option routers 1.1.34.3; 
}
```

- **설명**: `subnet`과 `netmask` 키워드를 사용해 네트워크와 서브넷 범위를 설정합니다.

---

## 6. 구성 상태 확인

#### Cisco IOS:

DHCP 상태를 확인하려면:

``` bash
R3# show ip dhcp pool
```


#### Linux (ISC DHCP):

DHCP 서버 로그를 확인하려면:

``` bash
sudo tail -f /var/log/syslog
```

- 클라이언트 요청과 DHCP 할당 상태를 확인할 수 있습니다.

---


### 주요 차이점


| **기능**        | **Cisco IOS**                   | **Linux ISC DHCP**                     |
| ------------- | ------------------------------- | -------------------------------------- |
| **설정 방식**     | CLI 명령어로 즉시 구성                  | 설정 파일을 편집 후 재시작 필요                     |
| **IP 풀 정의**   | `network`와 `default-router`로 구성 | `subnet`, `range`, `option routers` 사용 |
| **DNS 서버 설정** | `dns-server` 명령어                | `option domain-name-servers`로 구성       |
| **기본 게이트웨이**  | `default-router` 명령어            | `option routers`로 구성                   |
| **적용 방법**     | 명령 실행 시 바로 적용                   | 서비스 재시작 후 적용                           |










